using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace BookStore.Migrations
{
    /// <inheritdoc />
    public partial class SeedData : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Categories",
                columns: new[] { "Id", "Description", "Name" },
                values: new object[,]
                {
                    { 1, "این ژانر در جهان داستانی‌ای واقع شده که غالبا از افسانه‌ها و فولکور در جهان واقعی الهام گرفته شده است. ریشه این ژانر در سنت‌های شفاهی است و از قرن بیستم به رسانه های مختلفی از جمله فیلم، تلویزیون، رمان، فیلم‌های متحرک و بازی های ویدیویی راه یافته است.\r\nبا وجود همپوشانی برخی ژانرها با هم، این ژانر از کتاب به دلیل عدم وجود مضامین علمی و خیلی مهم، از ژانرهای دیگری چون علمی و ترسناک، متمایز است. این ژانر یکی از محبوب‌ترین انواع کتاب است", "فانتزی (Fantasy)" },
                    { 2, "داستانهای ماجراجویی، ژانری از داستان‌ها هستند که معمولاً خطرآفرینند یا هیجان را به خواننده القا می کنند.", "ماجراجویی (Action and adventure)" },
                    { 3, "این نوع کتاب، بر اساس روابط و احساسات بین دو نفر شکل گرفته شده‌است. اینگونه رمان‌ها خود به زیردسته‌هایی تقسیم می‌شوند. مثلا بهترین رمان های تاریخی عاشقانه یکی از این زیردسته‌هاست.", "عاشقانه (Romance)" },
                    { 4, "نویسنده در این سبک با تصویر کردن یک فضای وهم آور و ترسناک سعی در ترساندن و تهییج خواننده دارد. غالباً آنچه در یک کتاب داستانی ترسناک یک تهدید محسوب می‌شود، استعاره ای از ترس بزرگتر یک جامعه است.", " ترسناک (Horror)" },
                    { 5, "در این نوع از انواع کتاب، اغلب قهرمانی سرسخت و باهوش دیده می‌شود. اما این قهرمان انسانی معمولی است که در برابر اشرار قرار می‌گیرد و سعی در نجات کشور و … است.", "مهیج (Thriller)" },
                    { 6, "داستان‌های علمی-تخیلی، ژانری از کتاب است که به‌طور معمول با مفاهیم خیالی و آینده نگرانه سروکار دارد. مفاهیمی چون علم و فناوری، اکتشافات فضایی، سفر در زمان، جهان‌های موازی و زندگی فرازمینی.\r\nاین ژانر علاوه بر سرگرمی، می‌تواند جامعه‌ی امروزی را نیز مورد انتقاد قرار دهد و در بسیاری موارد نیز الهام‌بخش و زمینه‌ساز اکتشافات جدید باشد.", " علمی تخیلی (Science fiction)" },
                    { 7, "بیشتر کتاب‌های هنری،به شرح چگونگی خلق آثار هنری می‌پردازد. این آثار می‌تواند شامل آثار دیداری، شنیداری، نمایشی و … باشند.\r\nبسیاری ازین نوع کتاب‌ها، به بررسی زندگی هنرمندان بزرگ و معروف می‌پردازند و یا آثار هنری آنها را مورد نمقد و بررسی قرار می‌دهند. مطالعه تاریخ هنر و بررسی جنبه‌های زیباشناسانه‌ی آثار هنری از دیگر مباحثی است که در کتاب‌های هنری مورد توجه قرار می‌گیرد.", "هنری(Art)" },
                    { 8, "کتاب‌های انگیزشی ما را برای روبرویی با چالش‌های احتمالی زندگی واقعی آماده می‌کنند. در زندگی تمام انسان‌ها لحظاتی پیش می‌آید که از زندگی ناامید می‌شویم و تمام نیرو و انرژی‌مان تحلیل می‌رود. اینجاست که کتاب‌های انگیزشی به کمک ما می‌آیند.\r\nکتاب‌های روانشناسی و انگیزشی به خواننده فرصت شناخت خود را می‌دهد و به این ترتیب با نیروی بازیافته، مصمم به سمت هدف می‌رویم.", "انگیزشی(Motivational)" },
                    { 9, "نویسنده در کتاب‌های طنز، با ادبیاتی شیرین و نغز، مسائل مهم اجتماعی و سیاسی را با نگاهی نقادانه به رشته‌ی تحریر در می‌آورد. در این کتاب‌ها، تمام معایب و مفاسد و کمبودها به گونه‌ای اغراق‌آمیز بیان می‌شود تا زشتی آن مسئله بیشتر دیده‌شود.\r\n\r\n", "طنز(Humer)" },
                    { 10, "کودک تنها به خوراک و پوشاک نیاز ندارد. هرچند این‌ها نیازهای اولیه‌ی هر انسانی‌ست، اما رشد ذهنی نیز اهمیت ویژه‌ای در تربیت کودکان دارد.\r\nوظیفه‌ی هر والدی اینست که زمینه را برای چگونه زیستن و نحوه‌ی شکل‌گیری افکار و شخصیت کودکانمان هموار کند. چاپ کتاب‌ کودک و نوجوان کمک بزرگی برای خانواده‌ها محسوب می‌شوند.", "کودکان(Children’s)" },
                    { 11, "در این کتاب ها به شرح حال زندگی افراد پرداخته می‌شود، معمولا این نوع از کتاب ها به زبان خوده شخص و یا یک فرد دیگر برای افراد مشهور و شناخته شده نوشته میشود.", " کتاب های زندگینامه" }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 11);
        }
    }
}
